---
kind: other
id: Methods.T:Autodesk.Revit.DB.DefinitionFile
source: html/3a345800-4ee3-04ef-5a67-94a1b9840c27.htm
---
# DefinitionFile Methods

Causes the object to release immediately any resources it may be utilizing.